Check pt cleanup
